'''
предложить улучшения кода для уже решённых задач:
С помощью использования **лямбд, filter, map, zip, enumerate, list comprehension
'''

# Задайте последовательность чисел. 
# Напишите программу, которая выведет список 
# неповторяющихся элементов исходной последовательности.
nums = [2, 3, 5, 9, 3, 1, 2]
print(nums)

lst = [i for i in nums if nums.count(i) == 1]
print(lst)

# Напишите программу, которая принимает на вход вещественное число 
# и показывает сумму его цифр.
# Пример:

# - 6782 -> 23
# - 0,56 -> 11

n = input('Введите вещественное число: ')
sum = sum(map(int, n.replace('.', '')))
print (sum)

# Напишите программу, которая принимает на вход число N 
# и выдает набор произведений чисел от 1 до N.
# Пример:
# - пусть N = 4, тогда [ 1, 2, 6, 24 ] (1, 1*2, 1*2*3, 1*2*3*4)

from math import factorial
n = int(input('Введите число: '))
print(list(map(lambda x: ((x == 1) and 1) or x * factorial(x -1),list(range(1,n+1)))))
