'''
задача 3. Напишите программу, которая принимает на вход координаты точки (X и Y), 
и выдаёт номер четверти плоскости, в которой находится эта точка 
(или на какой оси она находится).
*Пример:*

- x=34; y=-30 -> 4
- x=2; y=4-> 1
- x=-34; y=-30 -> 3
'''

try:
    def quarter_number():
        x = float(input('Введите координату X: '))
        y = float(input('Введите координату Y: '))
        if x > 0 and y > 0:
            print('Точка находится в 1 четверти плоскости')
        elif x < 0 and y > 0:
            print('Точка находится во 2 четверти плоскости')
        elif x < 0 and y < 0:
            print('Точка находится в 3 четверти плоскости')
        elif x > 0 and y < 0:
            print('Точка находится в 4 четверти плоскости')
        elif x == 0 and y != 0:
            print('Точка находится на оси Y')
        elif x != 0 and y == 0:
            print('Точка находится на оси X')
    quarter_number()
except:
    print('Введите число')
