'''
задача 1. Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
*Пример:*
    - 6 -> да
    - 7 -> да
    - 1 -> нет
    - 
'''

try:
    n = int(input('Введите цифру дня недели: '))

    if n <= 7:
        if n > 5:
            if n == 6:
                print('Суббота, Выходной')
            elif n == 7:
                print('Воскресенье, Выходной')
        elif n == 1:
            print('Понедельник, Будни')
        elif n == 2:
            print('Вторник, Будни')
        elif n == 3:
            print('Среда, Будни')
        elif n == 4:
            print('Четверг, Будни')  
        elif n == 5:
            print('Пятница, Будни')  
    else:
        print('Введите целое число от 1 до 7')
except:
    print('Введите целое число')

    # try:
#     n = int(input('Введите цифру дня недели: '))
#     if n <= 7:
#         if n > 5:
#             print('Выходной')
#         else:
#             print('Будни')
#     else:
#         print('Введите целое число от 1 до 7')
# except:
#     print('Введите целое число')
