# Напишите программу, которая по заданному номеру четверти, 
# показывает диапазон возможных координат точек в этой четверти (x и y)



try:
    q = int(input('Введите номер четверти: '))
    if q > 4 or q < 1:
        print('Четверти с таким номером не существует')
    else:
        if q == 1:
            print(f'Диапазон возможных координат {q} четверти: X (0; ∞), Y (0; ∞)')
        elif q == 2:
            print(f'Диапазон возможных координат {q} четверти: X (- ∞; 0), Y (0; ∞)')
        elif q == 3:
            print(f'Диапазон возможных координат {q} четверти: X (- ∞; 0), Y (- ∞; 0)')
        elif q == 4:
            print(f'Диапазон возможных координат {q} четверти: X (0; ∞), Y (- ∞; 0)')
except:
    print('Введите целое число')

