'''
1. Напишите программу, которая принимает на вход два числа и проверяет, является ли одно число квадратом другого.
*Примеры:*  - 5, 25 -> да
            - 4, 16 -> да
            - 25, 5 -> да
            - 8,9 -> нет
'''

print('Является ли одно число квадратом другого');

def QuadNum():
    num1 = int(input('Введите num1: '))
    num2 = int(input('Введите num2: '))
    if num2 == num1 ** 2 or num1 == num2 ** 2: return True
    else: return False

print(QuadNum())