'''
2. Напишите программу, которая будет принимать на вход дробь 
и показывать первую цифру дробной части числа. 
    *Примеры:*
    - 6,78 -> 7
    - 5 -> нет
    - 0,34 -> 3
'''

try:
    d = float(input('Введите число: '))
    n = int(d * 10) % 10
    if int(d) - d == 0:
        print('нет')
    else: 
        print(n)
except:
    print('Введите дробное число')

# d = float(input('Введите число: '))
# st = str(d)
# n = st.find('.')
# print(st[n + 1])