# Даны два файла, в каждом из которых находится запись многочлена. 
# Задача - сформировать файл, содержащий сумму многочленов.


with open('file_1.txt', 'r') as data:
    for f_1 in data:
        print(f_1)

with open('file_2.txt', 'r') as data:
    for f_2 in data:
        print(f_2)


